#Пользователь вводит 3 числа, найти среднее арифмитическое с точностью 3
first_number = float(input("введите 1 число: "))
second_number = float(input("введите 2 число: "))
third_number = float(input("введите 2 число: "))
print(round((first_number + second_number + third_number)/3, 3))



