# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)

text = input("введите текст: ").upper()
dic = {"A": ".-", "B": "-...", "C": "-.-.", "D": "-..", "E": ".", "F": "..-.",
       "G": "--.", "H": "....", "I": "..", "J": ".---", "K": "-.-", "L": ".-..",
       "M": "--", "N": "-.", "O": "---", "P": ".--.", "Q": "--.-", "R": ".-.",
       "S": "...", "T": "-", "U": "..-", "V": "...-", "W": ".--", "X": "-..-",
       "Y": "-.--", "Z": "--..", "0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-",
       "5": ".....", "6": "-....", "7": "--...", "8": "---..", "9": "----."

       }


def morse(text):
    lst = []
    for i in range(len(text)):
        if text[i] not in dic:
            lst.append("")
        else:
            lst.append(dic[text[i]])
    return lst


print(" ".join(morse(text)))