count = 0
sex = "укажите свой пол м\ж? "
sex_correct = "укажите свой пол правильно м\ж? "
age = "укажите свой возраст  "
welcome = "Добро пожаловать на наш сайт! " \
          "для входа нужно заполнить анкету"
print(welcome)
while count <= 1 :
    sex2 = input(sex)
    if sex2 == "м" or sex2 =="ж" :
            print("информация сохранена")
    else :
        while sex2 != "м" or sex2!= "ж":
            sex3 = input(sex_correct)
            if sex3 == "м" or  sex3 =="ж" :
                sex2 = sex3
                break

    age2 = int(input(age))

    if sex2 == "м" and age2 < 18:
        "\n"
        print("---------------------------------"
              "---------------------------------")
        print("ты еще мальчик и у вас нет "
                  "доступа на сайт")
    elif age2 >= 18 and sex2 == "м":
            "\n"
            print("---------------------------------"
                  "---------------------------------")
            print("\n"'поздравляем вы уже зарегистрированы ')
            print( "ваш пол : Мужчина","\n""ваш возраст : ", age2 , "лет")
    if sex2 == "ж" and age2 < 18:
        "\n"
        print("---------------------------------"
              "---------------------------------")
        print("ты еще девушка и у вас нет доступа на сайт")
    elif sex2 == "ж" and age2 >= 18:
        "\n"
        print("---------------------------------"
              "---------------------------------")
        print("\n"'поздравляем вы уже зарегистрированы')
        print("ваш пол : Женщина", "\n""ваш возраст : ", age2, "лет")


    count +=1
    if count <= 1:
        "\n"
        print("---------------------------------"
              "---------------------------------")
        print("попробуйте еще раз и укажите другой пол")
else:
    print('Спасибо за ваше участие')